Tekla.Structures.Dialog.UIControls.Sorting.TeklaSort
An IComparer interface to sort lists in the same way that Tekla attribute and report lists are sorted.
Remarks: Tekla Structures sorting places lowercase letters before uppercase letters.
In all other cases, the local cultural info is used for sorting.
Note that using this comparer will tread upper and lowercase letters as different.